experiments/bench_results/gemv_ab/gemv_on__throughput_c8.log
INFO 09-23 14:50:31 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 09-23 14:50:31 [__init__.py:46] - fl -> vllm_fl:register
INFO 09-23 14:50:31 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO Print the version information of mcoplib during compilation.

Version info:Mcoplib_Version = '0.4.5'
Build_Maca_Version = '3.7.0.37'
GIT_BRANCH = 'HEAD'
GIT_COMMIT = 'a9125e4'
Vllm Op Version = 0.20.0
SGlang Op Version  = 0.5.10 

INFO Staring Check the current MACA version of the operating environment.

INFO: Release major.minor matching,  successful:3.7. 

INFO 09-23 14:50:58 [__init__.py:237] Platform plugin fl is activated
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fb6d426fce0>, trust_remote_code=False, seed=0, num_prompts=32, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='/root/models/MiniCPM5-2B', input_len=None, output_len=None, tokenizer='/root/models/MiniCPM5-2B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-a143bc06-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-23 14:51:06 [utils.py:90] Sampling input_len from [511, 511] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  8.04      
Total input tokens:                      16384     
Total generated tokens:                  4096      
Request throughput (req/s):              3.98      
Output token throughput (tok/s):         509.43    
Peak output token throughput (tok/s):    664.00    
Peak concurrent requests:                16.00     
Total token throughput (tok/s):          2547.13   
---------------Time to First Token----------------
Mean TTFT (ms):                          354.53    
Median TTFT (ms):                        361.89    
P50 TTFT (ms):                           361.89    
P90 TTFT (ms):                           588.59    
P99 TTFT (ms):                           595.48    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          12.97     
Median TPOT (ms):                        12.90     
P50 TPOT (ms):                           12.90     
P90 TPOT (ms):                           13.71     
P99 TPOT (ms):                           14.14     
---------------Inter-token Latency----------------
Mean ITL (ms):                           12.97     
Median ITL (ms):                         12.03     
P50 ITL (ms):                            12.03     
P90 ITL (ms):                            12.27     
P99 ITL (ms):                            16.05     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2001.98   
Median E2EL (ms):                        2082.53   
P50 E2EL (ms):                           2082.53   
P90 E2EL (ms):                           2318.66   
P99 E2EL (ms):                           2325.02   
==================================================

/opt/conda/envs/mx/lib/python3.12/site-packages/torch/library.py:381: UserWarning: Warning only once for all operators,  other operators may also be overridden.
  Overriding a previously registered kernel for the same operator and the same dispatch key
  operator: _C::cutlass_scaled_mm_supports_fp8(int cuda_device_capability) -> bool
    registered at /tmp/build-via-sdist-_ouj1d45/mcoplib-0.4.5+maca3.7.0.37.torch2.8/op/vllm/torch_bindings.cpp:26
  dispatch key: CompositeImplicitAutograd
  previous kernel: registered at /tmp/build-via-sdist-_ouj1d45/mcoplib-0.4.5+maca3.7.0.37.torch2.8/op/vllm/torch_bindings.cpp:26
       new kernel: registered at /dev/null:95 (Triggered internally at /workspace/framework/mcPytorch/aten/src/ATen/core/dispatch/OperatorEntry.cpp:218.)
  self.m.impl(
/opt/conda/envs/mx/lib/python3.12/site-packages/torchvision/datapoints/__init__.py:12: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
/opt/conda/envs/mx/lib/python3.12/site-packages/torchvision/transforms/v2/__init__.py:54: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:02<01:06,  2.15s/it]
 28%|██▊       | 9/32 [00:03<00:08,  2.80it/s]
 53%|█████▎    | 17/32 [00:05<00:04,  3.60it/s]
 56%|█████▋    | 18/32 [00:05<00:03,  3.66it/s]
 78%|███████▊  | 25/32 [00:07<00:02,  3.50it/s]
 81%|████████▏ | 26/32 [00:08<00:01,  3.57it/s]
100%|██████████| 32/32 [00:08<00:00,  3.98it/s]